//Класс для передачи текста для игровой области - русский
//--------------------------------------------------------------------------------------------------------------------------------------
namespace QuantumJourneys.Pages.Game.GameplayMeetingWithGod.LanguageTextGame
{
    //----------------------------------------------------------------------------------------------------------------------------------
    public class TextGame_Ru
    {
        public List<string> SetTextGame()
        {
#if DEBUG
            MyLogger.logger.LogInformation("Инициализация текста для UI русский - завершена.");
#endif
            return new List<string>
            {

            "Очнулся в белой комнате!",

            "Button_four: Выбор удивления - 1",
            "Button_four: Выбор удивления - 2",
            "Button_four: Выбор удивления - 3",
            "Button_four: Выбор удивления - 4",

            "Text: Неверится, что правда",

            "Button_four: Фраза: где это я - 1",
            "Button_four: Фраза: где это я - 2",
            "Button_four: Фраза: где это я - 3",
            "Button_four: Фраза: где это я - 4",

            "Text: Фраза уставшего бога - шутливая манера",
            "Text: Внезапно раздался голос. Вы оборачиваетесь.",

            "Img: maingod.png",
            "Text: Вы видите черный шар с шипами.",

            "Button_four: Фраза: ты кто - 1",
            "Button_four: Фраза: ты кто - 2",
            "Button_four: Фраза: ты кто - 3",
            "Button_four: Фраза: ты кто - 4",

            "Text: Бог расплывается в улыбке",
            "Text: Фраза бога: я это",

            "Button_four: Фраза: ну и что я здесь делаю? - 1",
            "Button_four: Фраза: ну и что я здесь делаю? - 2",
            "Button_four: Фраза: ну и что я здесь делаю? - 3",
            "Button_four: Фраза: ну и что я здесь делаю? - 4",

            "Text: Фраза бога: объяснение",

            "Button_four: Фраза: ну и что дальше? - 1",
            "Button_four: Фраза: ну и что дальше? - 2",
            "Button_four: Фраза: ну и что дальше? - 3",
            "Button_four: Фраза: ну и что дальше? - 4",

            "Text: Фраза бога: объяснение, что дальше (новая жизнь)",

            "Button_four: Фраза: удивление - 1",
            "Button_four: Фраза: удивление - 2",
            "Button_four: Фраза: удивление - 3",
            "Button_four: Фраза: удивление - 4",

            "Text: Фраза бога: двери видишь?",

            "Text: оборачиваешься",

            "Img: doorstonewworld.png",

            "Button_four: Фраза: удивление - 1",
            "Button_four: Фраза: удивление - 2",
            "Button_four: Фраза: удивление - 3",
            "Button_four: Фраза: удивление - 4",

            "Text: Фраза бога: объяснение про двери",

            "Button_four: Фраза: давай играть - 1",
            "Button_four: Фраза: давай играть - 2",
            "Button_four: Фраза: давай играть - 3",
            "Button_four: Фраза: давай играть - 4",

            "MiniGame: OpenDoor",

            "Text: Фраза бога: заходи, удачи",

            "Button_two: Выбор: зайти - 1",
            "Button_two: Выбор: зайти - 2",

            "EndScene",

            };
        }
    }
    //----------------------------------------------------------------------------------------------------------------------------------
}
//--------------------------------------------------------------------------------------------------------------------------------------
