//Класс с функцие получения случайного текста
//--------------------------------------------------------------------------------------------------------------------------------------
namespace QuantumJourneys.Pages.Game.HelpFunction
{

    //----------------------------------------------------------------------------------------------------------------------------------
    public class RandomText
    {
        //--------------------------------------------------------------------------------------------------------------------------------------

        private int randomCounterText = 0;
        private Random rnd_Number = new();

        //--------------------------------------------------------------------------------------------------------------------------------------
        public string GetRandomText(string[][] randomText)
        {
            int value = rnd_Number.Next(0, GetNumberLineInText(randomText) - 1);
            string receivedText = randomText[randomCounterText][value];
            randomCounterText++;
            return receivedText;
        }
        private int GetNumberLineInText(string[][] randomText) => randomText[randomCounterText].Count();
    }
    //----------------------------------------------------------------------------------------------------------------------------------
}
//--------------------------------------------------------------------------------------------------------------------------------------
