//Текст для страницы MenuPage - русский
//--------------------------------------------------------------------------------------------------------------------------------------
namespace QuantumJourneys.Pages.MenuPage.Language
{
    //----------------------------------------------------------------------------------------------------------------------------------
    public class Menu_Ru
    {
        //------------------------------------------------------------------------------------------------------------------------------
        public Menu_Ru(MainPage mainPage)
        {
            Button SoloGameBtn = (Button)mainPage.FindByName("SoloGameBtn");
            SoloGameBtn.Text = "Одиночная игра";
            Button MultyGameBtn = (Button)mainPage.FindByName("MultyGameBtn");
            MultyGameBtn.Text = "Мультиплеерная игра";
            Button SettingBtn = (Button)mainPage.FindByName("SettingBtn");
            SettingBtn.Text = "Настройки";
            Button ExitBtn = (Button)mainPage.FindByName("ExitBtn");
            ExitBtn.Text = "Выход";
        }
        //------------------------------------------------------------------------------------------------------------------------------
    }
    //----------------------------------------------------------------------------------------------------------------------------------
}
//--------------------------------------------------------------------------------------------------------------------------------------
