//Класс для мультиплеерной игры
//--------------------------------------------------------------------------------------------------------------------------

namespace QuantumJourneys.Pages.CreateGameMulty;

//--------------------------------------------------------------------------------------------------------------------------

public partial class CreateGameMultyPage : ContentPage
{
    //--------------------------------------------------------------------------------------------------------------------------
    public CreateGameMultyPage()
	{
		InitializeComponent();
	}
    //--------------------------------------------------------------------------------------------------------------------------
    private void SoloGameBtn_Clicked(object sender, EventArgs e)
    {
        var nextPage = new MainPage();
        var currentPage = Application.Current.MainPage;

        currentPage.Navigation.PopAsync();
        Application.Current.MainPage = nextPage;
    }
    //--------------------------------------------------------------------------------------------------------------------------
}
//--------------------------------------------------------------------------------------------------------------------------